class script(object):
    START_TXT = """<b>היי {} 👋\nברוך הבא ל <a href=https://t.me/{}>{}</a> 😎
    
אני מנוע חיפוש סרטים וסדרות חדשני, התפקיד שלי זה לחפש סרטים בקבוצות, הוסיפו אותי לקבוצה שלכם ואני אמשיך מכאן</b>"""

    CLONE_START_TXT = """<b><blockquote>היי {},\nברוך הבא ל <a href=https://t.me/{}>{}</a></blockquote>
    
אני בוט סינון אוטומטי מתקדם ועוצמתי עם יכולות מדהימות. פשוט הקלד מה שאתה רוצה ותראה את הכוח שלי. 💘</b>"""
    
    HELP_TXT = """<b>היי {},
כאן תוכל לקבל עזרה עבור כל הפקודות שלי.</b>"""

    ABOUT_TXT = """<b><blockquote>⍟───────[ <a href='https://t.me/searchgram_robot'>הפרטים שלי</a> ]───────⍟</blockquote>
    
⇚ השם שלי: <a href=https://t.me/{}>{}</a>
⇚ המפתח שלי: @BOSS1480
⇚ ספריה: <a href='https://docs.pyrogram.org/'>ᴘʏʀᴏɢʀᴀᴍ</a> 
⇚ שפה: <a href='https://www.python.org/download/releases/3.0/'>ᴘʏᴛʜᴏɴ 3</a> 
⇚ דאטה בייס: <a href='https://www.mongodb.com/'>ᴍᴏɴɢᴏ ᴅʙ</a> 
⇚ סטטוס בנייה: גרסה 2.7.1 [יציב]</b>"""

    CLONE_ABOUT_TXT = """<b><blockquote>⍟───────[ <a href='https://t.me/searchgram_robot'>הפרטים שלי</a> ]───────⍟</blockquote>
    
⇚ השם שלי : <a href=https://t.me/{}>{}</a>
⇚ המפתח שלי : <a href='tg:user?id=6335855540'>BOSS1480</a> 
⇚ ספריה : <a href='https://docs.pyrogram.org/'>ᴘʏʀᴏɢʀᴀᴍ</a> 
⇚ שפה : <a href='https://www.python.org/download/releases/3.0/'>ᴘʏᴛʜᴏɴ 3</a> 
⇚ דאטה בייס : <a href='https://www.mongodb.com/'>ᴍᴏɴɢᴏ ᴅʙ</a> 
⇚ סטטוס בנייה: גרסה 2.7.1 [יציב]</b>"""

    CLONE_TXT = """<b>🌟 <u>מצב שיבוט</u>

- אתה יוצר בוט שיבוט משלך באמצעות הפקודה /clone
- אתה יכול לשדר הודעות בבוטים המשובטים שלך
- כבר נוספו מיליוני קבצים, אין צורך להוסיף קבצים נוספים

👨‍💻 פקודה: /clone</b>"""

    SUBSCRIPTION_TXT = """
<b>שתף את הקישור שלך לחברים, משפחה, ערוץ וקבוצה כדי לקבל פרימיום חינם עבור {}

קישור הפניה - https://telegram.me/{}?start=VJ-{}

אם {} משתמשים ייחודיים יתחילו את הבוט באמצעות קישור ההפניה שלך, תצורף אוטומטית לרשימת הפרימיום.

קנה תוכנית בתשלום באמצעות - /plan</b>"""



    MANUELFILTER_TXT = """<b>פילטרים</b>
- פילטר הוא תכונה שבה משתמשים יכולים להגדיר תגובות אוטומטיות למילת מפתח מסוימת, ואני אגיב בכל פעם שמילת מפתח כזו תימצא בהודעה.

<b>הערה:</b>
1. לבוט זה צריכות להיות הרשאות מנהל.
2. רק מנהלים יכולים להוסיף מסננים בצ'אט.
3. לכפתורי התראה יש מגבלה של 64 תווים.

<b>פקודות ושימוש:</b>
• /filter - הוספת פילטר בצ'אט
• /filters - רשימת כל הפילטרים בצ'אט
• /del - מחיקת פילטר ספציפי בצ'אט
• /delall - מחיקת כל פילטרים בצ'אט (בעל הצ'אט בלבד)</code>"""



    BUTTON_TXT = """<b>כפתורים</b>
- בוט זה תומך בכפתורי URL ובכפתורי התראה מוטבעים.
<b>הערה:</b>
1. טלגרם לא מאפשר לשלוח כפתורים ללא תוכן, ולכן תוכן הוא חובה.
2. בוט זה תומך בכפתורים עם כל סוגי המדיה של טלגרם.
3. יש לנתח כפתורים כראוי בפורמט Markdown.
<b>כפתורי URL:</b>
<code>[טקסט הכפתור](buttonurl:https://t.me/bot_sratim_sdarot/56)</code>
<b>כפתורי התראה:</b>
<code>[טקסט הכפתור](buttonalert:זוהי הודעת התראה)</code>"""

    AUTOFILTER_TXT = """<b>סינון אוטומטי</b>
<b>הערה: אינדקס קבצים</b>
1. הפוך אותי למנהל בערוץ שלך אם הוא פרטי.
2. ודא שהערוץ שלך לא מכיל סרטוני מצלמה (camrips), פורנו וקבצים מזויפים.
3. העבר אליי את ההודעה האחרונה עם ציטוט. אני אוסיף את כל הקבצים בערוץ הזה למסד הנתונים שלי.

<b>הערה: סינון אוטומטי</b>
1. הוסף את הבוט כמנהל בקבוצה שלך.
2. השתמש ב- /connect וחבר את הקבוצה שלך לבוט.
3. השתמש ב- /settings בהודעה הפרטית של הבוט והפעל את הסינון האוטומטי בתפריט ההגדרות."""

    CONNECTION_TXT = """<b>חיבורים</b>
- משמש לחיבור הבוט להודעות הפרטיות שלך לניהול מסננים.
- זה עוזר למנוע ספאם בקבוצות.
<b>הערה:</b>
1. רק מנהלים יכולים להוסיף חיבור.
2. שלח <code>/connect</code> כדי לחבר אותי להודעות הפרטיות שלך.
פקודות ושימוש:
• /connect - חיבור צ'אט מסוים להודעות הפרטיות שלך
• /disconnect - ניתוק מהצ'אט
• /connections - רשימת כל החיבורים שלך"""



    EXTRAMOD_TXT = """<b><u>מודולים נוספים</u></b>
  
 
./id - <code>קבל מזהה של משתמש ספציפי.</code> 
  
./info  - קבל מידע על משתמש. 
  
./telegraph - מחולל Telegraph שלח וידאו או תמונה עד 5MB ואחזיר קישור telegraph 
  
./tts - פקודה זו משמשת להמרת טקסט לדיבור 
  
./video - פקודה זו משמשת להורדת כל סרטון מיוטיוב באיכות HD [דוגמה /video https://youtu.be/example...]

./font - פקודה זו משמשת לייצר גופן מעוצב ומגניב [דוגמה <code>/font hi</code>]"""


    ADMIN_TXT = """<u><b>תפריט ניהול</b>

</u>מודול זה עובד רק עבור המנהלים שלי !!

<b>פקודות ושימוש:</b>

• /logs - לקבל את השגיאות האחרונות
• /stats - <code>לקבל סטטוס של קבצים במסד הנתונים. [פקודה זו זמינה לכל אחד]</code>
• /delete - למחוק קובץ ספציפי ממסד הנתונים.
• /users - לקבל רשימת משתמשים ו-IDs.
• /chats - לקבל רשימת צ'אטים ו-IDs
• /leave  - לעזוב צ'אט.
• /disable  -  לנטרל צ'אט.
• /ban  - לחסום משתמש.
• /unban  - לשחרר משתמש מחסימה.
• /channel - לקבל רשימת ערוצים מחוברים
• /broadcast - לשדר הודעה לכל המשתמשים
• /grp_broadcast - לשדר הודעה לכל הקבוצות המחוברות.
• /gfilter - להוסיף סינון גלובלי
• /gfilters - לצפות בכל הסינונים הגלובליים
• /delg - למחוק סינון גלובלי ספציפי
• /request - לשלוח בקשת סרט/סדרה למנהלי הבוט. עובד רק בקבוצת התמיכה. [פקודה זו זמינה לכל אחד]
• /delallg - למחוק את כל הסינונים הגלובליים ממסד הנתונים של הבוט.
• /deletefiles - למחוק קובצי CamRip ו-PreDVD ממסד הנתונים של הבוט."""

    SEC_STATUS_TXT = """<b>★ Tᴏᴛᴀʟ Usᴇʀs: <code>{}</code>
★ Tᴏᴛᴀʟ Cʜᴀᴛs: <code>{}</code>
★ Tᴏᴛᴀʟ Fɪʟᴇs: <code>{}</code>
★ Usᴇᴅ Sᴛᴏʀᴀɢᴇ: <code>{} MB</code>
★ Fʀᴇᴇ Sᴛᴏʀᴀɢᴇ: <code>{} MB</code></b>"""
    
    STATUS_TXT = """<b>Total Files From All DBs: <code>{}</code>

USERS DB :-
★ Tᴏᴛᴀʟ Usᴇʀs: <code>{}</code>
★ Tᴏᴛᴀʟ Cʜᴀᴛs: <code>{}</code>

FILE FIRST DB :-
★ Tᴏᴛᴀʟ Fɪʟᴇs: <code>{}</code>
★ Usᴇᴅ Sᴛᴏʀᴀɢᴇ: <code>{} MB</code>
★ Fʀᴇᴇ Sᴛᴏʀᴀɢᴇ: <code>{} MB</code>

FILE SECOND DB :-
★ Tᴏᴛᴀʟ Fɪʟᴇs: <code>{}</code>
★ Usᴇᴅ Sᴛᴏʀᴀɢᴇ: <code>{} MB</code>
★ Fʀᴇᴇ Sᴛᴏʀᴀɢᴇ: <code>{} MB</code>

OTHER DB :-
★ Usᴇᴅ Sᴛᴏʀᴀɢᴇ: <code>{} MB</code>
★ Fʀᴇᴇ Sᴛᴏʀᴀɢᴇ: <code>{} MB</code></b>b"""
    
    LOG_TEXT_G = """#NewGroup
Gʀᴏᴜᴘ = {}(<code>{}</code>)
Tᴏᴛᴀʟ Mᴇᴍʙᴇʀs = <code>{}</code>
Aᴅᴅᴇᴅ Bʏ - {}"""

    LOG_TEXT_P = """#NewUser
ID - <code>{}</code>
Nᴀᴍᴇ - {}"""

    ALRT_TXT = """שלום {},  
זה לא הבקשה שלך לסרט,  
בקש אתה בעצמך..."""

    OLD_ALRT_TXT = """היי {},  
אתה משתמש באחד מההודעות הישנות שלי,  
אנא שלח שוב את הבקשה.."""

    CUDNT_FND = """לא הצלחתי למצוא כל דבר שקשור ל-{}  
האם התכוונת לאחד מהדברים האלה?"""

    I_CUDNT = """לא נמצאו תוצאות עבור <b>"{}"</b>😕"""

    I_CUD_NT = """לא הצלחתי למצוא כל סרט שקשור ל-{}.  
אנא בדוק את האיות בגוגל או ב-IMDb..."""

    MVE_NT_FND = """הסרט לא נמצא במסד הנתונים..."""

    TOP_ALRT_MSG = """בודק עבור הסרט במסד הנתונים..."""

    MELCOW_ENG = """<b>שלום {} 😍, וברוך הבא לקבוצה {} ❤️</b>"""

    SHORTLINK_INFO = """

🫵 בחר את השפה שלך והרוויח כסף 💰"""

    REQINFO = """
⚠ מידע ⚠ 

לאחר 5 דקות, הודעה זו תימחק אוטומטית. 

אם אינך רואה את קובץ הסרט/סדרה המבוקש, הסתכל בדף הבא."""


    SELECT = "בחר את השפה המועדפת עליך, איכות, עונה ופרק."

    SINFO = """<b>כדי לקבל את הסרט,
אנא הצטרף קודם ולערוץ ואז לחץ על כפתור נסה שוב.</b>"""

    NORSLTS = """
★ #𝗡𝗼𝗥𝗲𝘀𝘂𝗹𝘁𝘀 ★

𝗜𝗗: <code>{}</code>

𝗡𝗮𝗺𝗲: <b>{}</b>

𝗠𝗲𝘀𝘀𝗮𝗴𝗲: <b>{}</b>
"""

    CAPTION = """<b>{file_name}

{file_size}</b>"""

    IMDB_TEMPLATE_TXT = """
<b>שאלה: {qurey}

נתוני imdb:

<b>🏷 כותרת</b>: <a href={url}>{title}</a>
🎭 ז\'אנרים: {genres}
📆 שנה: <a href={url}/releaseinfo>{year}</a>
🌟 דירוג: <a href={url}/ratings>{rating}</a> / 10 (based on {votes} user ratings.)
☀️ שפות: <code>{languages}</code>
📀 זמן סרט: {runtime} Minutes
📆 מידע על שחרור: {release_date}
🎛 מדינות: <code>{countries}</code>


⏰תוצאה מוצגת ב: {remaining_seconds} <i>שניות</i> 🔥

מתבקש על ידי: {message.from_user.mention}</b>"""
    
    ALL_FILTERS = """
<b>היי {}, אלה שלוש הסוגים שלי של פילטרים.</b>"""
    
    GFILTER_TXT = """
<b>ברוך הבא לפילטרים גלובליים.
פילטרים גלובליים הם הפילטרים שמוגדרים על ידי מנהלי הבוט אשר יעבדו על כל הקבוצות.</b>
    
<b>פקודות זמינות:</b>
• /gfilter - כדי להוסיף פילטר גלובלי.
• /gfilters - כדי לראות את כל הפילטרים הגלובליים
• /delg - כדי למחוק פילטר גלובלי 
• /delallg - כדי למחוק את כל הפילטרים הגלובליים."""
    
    FILE_STORE_TXT = """
<b>אחסון קבצים היא התכונה שתיצור קישור שניתן לשתף של קובץ בודד או של מספר קבצים.</b>

פקודות זמינות:
• /batch - כדי ליצור קישור קבוצתי של מספר קבצים.  
• /link - כדי ליצור קישור של קובץ בודד.  
• /pbatch - בדיוק כמו /batch, אך הקבצים יישלחו עם מגבלות הפנייה.  
• /plink - בדיוק כמו /link, אך הקובץ יישלח עם מגבלות הפנייה."""

    SONG_TXT = """<b>מודול הורדת שירים</b>  

<b>מודול הורדת שירים, עבור מי שאוהב מוסיקה. אתה יכול להשתמש בתכונה זו כדי להוריד כל שיר במהירות עליונה. פועל עם בוטים וקבוצות בלבד...</b>  

<b>פקודות:</b> <b>𝄟⃝.  /song שם השיר</b></b>"""
  
    YTDL_TXT = """<b>עוזר לך להוריד ווידאו מיוטיוב.  

שימוש: אתה יכול להוריד כל ווידאו מיוטיוב.  

איך להשתמש: הקלד - /video או /mp4.  

דוגמה: <code>/mp4 https://youtu.be/example...</code></b>"""
  
    TTS_TXT = """<b>TTS 🎤 __המרת טקסט לדיבור__

פקודות ושימוש: /tts</b>"""
  
    GTRANS_TXT = """<b>גוגל תרגום

פקודה זו עוזרת לך לתרגם טקסט לכל שפה שתרצה. פקודה זו פועלת גם בהודעות פרטיות וגם בקבוצות.

פקודות ושימוש: /tr - כדי לתרגם טקסטים לשפה ספציפית.

הערה: בזמן השימוש ב-/tr עליך לציין את קוד השפה.

דוגמה: /tr ml
• en = אנגלית
• ml = מליאלאם
• hi = הינדית</b>"""
  
    TELE_TXT = """<b>עזרה: שלח מה שתרצה עם מודול telegraph!

שימוש: /telegraph - שלח לי תמונה או וידאו עד (5MB)

הערה:
פקודה זו זמינה בקבוצות ובהודעות פרטיות.
פקודה זו יכולה להיבנות על ידי כולם.</b>""" 
  
    CORONA_TXT = """<b>עזרה: COVID

פקודה זו עוזרת לך לדעת מידע יומי על COVID.

פקודות ושימוש:

/covid - השתמש בפקודה זו עם שם המדינה שלך כדי לקבל מידע על COVID.
דוגמה: <code>/covid India</code></b>
  
 ⚠️ השירות הזה הופסק!!
  
 </b>"""

    PROGRESS_BAR = """\n
╭━━━━❰ File Is Renaming... ❱━➣
┣⪼ 🗂️ : {1} | {2}
┣⪼ ⏳️ : {0}%
┣⪼ 🚀 : {3}/s
┣⪼ ⏱️ : {4}
╰━━━━━━━━━━━━━━━➣ """
  
    ABOOK_TXT = """<b><b>עזרה: אודיו-בוק

אתה יכול להמיר קובץ PDF לקובץ אודיו עם הפקודה הזו ✯

פקודות ושימוש:
/audiobook: השב לפקודה זו על כל PDF כדי לייצר את האודיו.
</b>"""
  
 
    PINGS_TXT = """<b>פינג טסטינג: עוזר לך לדעת את הפינג שלך 🪄

פקודות:
• /alive - לבדוק אם אתה חי.
• /help - לקבל עזרה.
• /ping - <b>לקבל את הפינג שלך.

שימוש:
• הפקודות הללו יכולות לשמש בהודעות פרטיות ובקבוצות.
• הפקודות הללו יכולות לשמש על ידי כולם בקבוצות ובוטים בהודעות פרטיות.
• שתף אותנו עבור תכונות נוספות.</b>
  </b>"""
  
    STICKER_TXT = """<b>ניתן להשתמש בפקודה הזאת כדי למצוא מזהי מדבקות. 
 • שימוש: לקבלת מזהה מדבקה. 
   
 ⭕ כיצד להשתמש: 
 /stickerid
 </b>"""
  
    FONT_TXT= """<b> 
  שימוש:

אתה יכול להשתמש בפקודה הזאת כדי לשנות את סגנון הפונט.

פקודה: /font טקסט שלך (אופציונלי)
דוגמה: /font searchgram
 </b>"""
  
    PURGE_TXT = """<b>פורג'

מוחק הרבה מסרים מקבוצות!

מנהל

◉ /purge :- מוחק את כל המסרים מההודעה שהגבת לה, עד להודעה הנוכחית.</b>"""
  
    WHOIS_TXT = """<b>מודול מי זה

הערה: מספק פרטי משתמש

/whois :- מספק פרטים מלאים על המשתמש 📑
 </b>"""
  
    JSON_TXT = """<b> 
JSON:

הבוט מחזיר JSON עבור כל ההודעות שהגבת להן עם /json

תכונות:

עריכת הודעות ב-JSON
תמיכה בהודעות פרטיות
תמיכה בקבוצות

הערה:

כולם יכולים להשתמש בפקודה הזו, אך אם מתרחשת ספאם, הבוט יחסום אותך אוטומטית מהקבוצה.</b>"""
  
    URLSHORT_TXT = """<b>עזרה: מקצר URL

<i><b>פקודה זו עוזרת לך לקצר URL.</i></b>

פקודות ושימוש:

/short: <b>השתמש בפקודה זו עם הקישור שלך כדי לקבל קישורים מקוצרים.</b>
דוגמה: <code>/short https://youtu.be/example...</code>
</b>"""
  
    CARB_TXT = """<b>עזרה עבור carbon

הפקודה carbon היא תכונה שמאפשרת ליצור תמונה כפי שמוצגת בראש עם הטקסטים שלך.
כדי להשתמש במודול, פשוט שלח את הטקסט והשתמש בפקודת /carbon. הבוט יגיב עם התמונה על בסיס הטקסט שלך.
</b>"""
    GEN_PASS = """<b>עזרה: מחולל סיסמאות

אין מה לדעת יותר. שלח לי את הגבול של הסיסמה שלך.
- אני אספק את הסיסמה בהתאם לגבול הזה.

פקודות ושימוש:
• /genpassword או /genpw 20

הערה:
• רק מספרים מותרים
• מספר מקסימלי של מספרים עד 84
(אני לא יכול ליצור סיסמאות באורך מעל 84)
• IMDB צריך להיות עם הרשאות מנהל.
• הפקודות הללו פועלות גם בהודעות פרטיות וגם בקבוצות.
• הפקודות הללו יכולות לשמש על ידי כל חבר בקבוצה..</b>"""
  
    SHARE_TXT = """<b>קבל את ה-URL לשיתוף הטקסט שלך.

- דוגמה: /share
  
 </b>"""
  
    PIN_TXT = """<b>מודול פין
פין הודעה...

כל הפקודות הקשורות לפין ניתן למצוא כאן:

📌פקודות ושימוש📌

/pin :- כדי לפין את ההודעה בשיחות שלך
/unpin :- כדי להסיר את הפין מההודעה המודגשת הנוכחית</b>"""

 
    RESTART_TXT = """
<b>הבוט רץ !

📅 תאריך : <code>{}</code>
⏰ זמן : <code>{}</code>
🌐 אזור זמן : <code>Asia/Jerusalem</code>
🛠️ גרסת בוט: <code>v2.7.1 [ Sᴛᴀʙʟᴇ ]</code></b>"""

    LOGO = """
████████╗███████╗███████╗██╗  ██╗    ╔██        ██╗       ██╗
╚═ ██╔══╝██╔════╝██╔════╝██║  ██║     ║██      ██║        ██║
   ██║    █████╗  ██║      ███████║      ║██    ██║         ██║
   ██║    ██╔══╝  ██║      ██╔══██║       ║██  ██║  ╔██     ██║
   ██║    ███████╗███████╗██║  ██║        ║████║   ║████████║
   ╚═╝    ╚══════╝╚══════╝╚═╝  ╚═╝        ╚════╝   ╚════════╝"""
 
    TAMIL_INFO = """אני תומך רק באנגלית ועברית😊"""

    ENGLISH_INFO = """
Hey <a href='tg://settings'>ᴍʏ ғʀɪᴇɴᴅ</a> 


 Now you can earn money on Telegram too.

 You must have 1 group to earn money by telegram.
 If you have a group, you can earn money by adding our bot to your group.

 The more members you have in your group, the higher your income will be.

 How and what to do

 Step 1: Administer this VJ-FILTER-BOT bot to your group

 Step 2: Add your website and API

 Exp: /shortlink omegalinks.in 4b392f8eb6ad711fbe58

 Add a video

 👇 How to add 👇

 Exp: /set_tutorial video link

Also your tutorial will be Added Your Group..."""

    TELUGU_INFO = """אני תומך רק באנגלית ועברית😊"""

    HINDI_INFO = """אני תומך רק באנגלית ועברית😊"""

    MALAYALAM_INFO = """אני תומך רק באנגלית ועברית😊"""

    URTU_INFO = """אני תומך רק באנגלית ועברית😊"""

    GUJARATI_INFO = """אני תומך רק באנגלית ועברית😊"""

    BANGLADESH_INFO = """אני תומך רק באנגלית ועברית😊"""

    RENAME_TXT = """
🌌 <b><u>איך להגדיר תמונת תצוגה</u></b>

•> /set_thumb - שלח כל תמונה כדי להגדיר אוטומטית תמונת תצוגה.
•> /del_thumb - השתמש בפקודה זו כדי למחוק את תמונת התצוגה הישנה שלך.
•> /view_thumb - השתמש בפקודה זו כדי לראות את תמונת התצוגה הנוכחית שלך.

📑 איך להגדיר כיתוב מותאם אישית

•> /set_caption - הגדר כיתוב מותאם אישית
•> /see_caption - ראה את הכיתוב המותאם אישית שלך
•> /del_caption - מחק כיתוב מותאם אישית

דוגמה: /set_caption 📕 שם קובץ: {filename}
💾 גודל: {filesize}
⏰ משך: {duration}

✏️ איך לשנות שם של קובץ

•> /rename - שלח כל קובץ ולחץ על אפשרות שינוי שם, הקלד שם קובץ חדש ואז בחר [מסמך, וידאו, אודיו] 👈 בחר את זה.
"""

    STREAM_TXT = """<b><u>איך לקבל קישור סטרימינג והורדה:</u>

/stream - קבל קישור סטרימינג וקישור להורדה של כל קובץ</b>"""
